Repository: davidcharbonnier/alacarte-client
Catalog: lib/l10n/app_*.arb
Languages: fr

# welcomeTitle
source: Welcome to A la carte
fr: Bienvenue sur A la carte

# welcomeSubtitle
source: Your personal rating and preference hub
fr: Votre centre personnel d'évaluations et de préférences

source: Your Preference Lists
fr: Vos Listes de Préférences

# moreCategoriesTitle
source: More Categories
fr: Plus de Catégories

# moreCategoriesSubtitle
source: Additional categories coming soon
fr: D'autres catégories arrivent bientôt

# itemsAvailable
source: {count} items available
fr: {count} articles disponibles

# inYourList
source: {count} in your list
fr: {count} dans votre liste

source: Cheese
fr: Fromage

source: Settings
fr: Paramètres

source: Profile Settings
fr: Paramètres du Profil

source: Toggle theme
fr: Changer le thème

source: Online
fr: En ligne

source: Offline
fr: Hors ligne

source: Checking connection
fr: Vérification de la connexion

# offlineMessage
source: Offline - Your reference lists may not be up to date
fr: Hors ligne - Vos listes de références peuvent ne pas être à jour

source: Connected to A la carte
fr: Connecté à A la carte

# noInternetConnection
source: Connection lost - Working offline
fr: Connexion perdue - Mode hors ligne

source: User Selection
fr: Sélection d'Utilisateur

source: Create User
fr: Créer un Utilisateur

source: Edit User
fr: Modifier l'Utilisateur

source: User Name
fr: Nom d'Utilisateur

source: Name
fr: Nom

source: Origin
fr: Origine

source: Producer
fr: Producteur

source: Save
fr: Enregistrer

source: Cancel
fr: Annuler

source: Delete
fr: Supprimer

source: Edit
fr: Modifier

source: Create
fr: Créer

source: Search
fr: Rechercher

source: Filter
fr: Filtrer

source: Clear Filters
fr: Effacer les Filtres

# allItems
source: All {itemType}s
fr: Tous les {itemType}s

source: My List
fr: Ma Liste

source: Rating
fr: Évaluation

source: My Rating
fr: Mon Évaluation

source: Shared Ratings
fr: Évaluations Partagées

source: Rate Item
fr: Évaluer l'Article

source: Add Rating
fr: Ajouter une Évaluation

source: Edit Rating
fr: Modifier l'Évaluation

source: Back
fr: Retour

source: Home
fr: Accueil

source: Error
fr: Erreur

source: Loading...
fr: Chargement...

source: No data available
fr: Aucune donnée disponible

source: Try Again
fr: Réessayer

source: Refresh
fr: Actualiser

# chooseProfileSubtitle
source: Choose your profile to access your ratings and preferences
fr: Choisissez votre profil pour accéder à vos évaluations et préférences

source: Search profiles...
fr: Rechercher des profils...

source: Create New Profile
fr: Créer un Nouveau Profil

source: Delete Profile
fr: Supprimer le Profil

# deleteProfileConfirmation
source: Are you sure you want to delete the profile "{profileName}"?
fr: Êtes-vous sûr de vouloir supprimer le profil "{profileName}" ?

source: No profiles found
fr: Aucun profil trouvé

# tryDifferentSearch
source: Try searching with a different name
fr: Essayez de rechercher avec un nom différent

# currentlyUsing
source: Currently using: {userName}. Tap a different profile to switch or tap the selected one to continue.
fr: Actuellement utilisé : {userName}. Appuyez sur un profil différent pour changer ou appuyez sur celui sélectionné pour continuer.

# offlineProfileChanges
source: Offline - Profile changes may not be saved until reconnected
fr: Hors ligne - Les modifications du profil peuvent ne pas être sauvegardées jusqu'à la reconnexion

source: Create Your Profile
fr: Créer Votre Profil

source: Edit Your Profile
fr: Modifier Votre Profil

# nameHint
source: Enter your name
fr: Entrez votre nom

# profileHelpCreate
source: Your profile helps you track your cheese ratings and preferences.
fr: Votre profil vous aide à suivre vos évaluations et préférences de fromages.

# profileHelpEdit
source: Update your profile information.
fr: Mettez à jour les informations de votre profil.

source: Current Profile
fr: Profil Actuel

source: Profile Management
fr: Gestion du Profil

source: Edit Profile
fr: Modifier le Profil

# editProfileSubtitle
source: Update your profile information
fr: Mettez à jour les informations de votre profil

source: Switch Profile
fr: Changer de Profil

# switchProfileSubtitle
source: Change to a different profile
fr: Passer à un profil différent

# deleteProfileSubtitle
source: Permanently delete this profile
fr: Supprimer définitivement ce profil

# deleteWarning
source: This action cannot be undone. All data associated with this profile will be permanently deleted.
fr: Cette action ne peut pas être annulée. Toutes les données associées à ce profil seront définitivement supprimées.

# noProfileSelected
source: No profile selected. Please select a profile first.
fr: Aucun profil sélectionné. Veuillez d'abord sélectionner un profil.

source: Back to App
fr: Retour à l'Application

source: No Profiles Yet
fr: Aucun Profil Encore

# noProfilesMessage
source: No profiles found. Create your first profile to get started!
fr: Aucun profil trouvé. Créez votre premier profil pour commencer !

# nameRequired
source: Name is required
fr: Le nom est requis

# nameMinLength
source: Name must be at least 2 characters
fr: Le nom doit contenir au moins 2 caractères

# nameMaxLength
source: Name must be less than 50 characters
fr: Le nom doit contenir moins de 50 caractères

# nameInvalidCharacters
source: Name can only contain letters, spaces, hyphens, and apostrophes
fr: Le nom ne peut contenir que des lettres, des espaces, des tirets et des apostrophes

source: Back to Hub
fr: Retour au Centre

# myItemList
source: My {itemType} List
fr: Ma Liste de {itemType}s

# addItem
source: Add {itemType}
fr: Ajouter {itemType}

source: More Categories Coming Soon
fr: Plus de Catégories Bientôt

# shared
source: Shared ({count})
fr: Partagé ({count})

# moreRatings
source: +{count} more
fr: +{count} de plus

# rateThisItem
source: Rate this {itemType}
fr: Évaluer ce {itemType}

# comingSoon
source: {itemType} Coming Soon
fr: {itemType} Bientôt Disponible

# noItemsAvailable
source: No {itemType}s Available
fr: Aucun {itemType} Disponible

# addFirstItem
source: Add the first {itemType} to start building your reference list
fr: Ajoutez le premier {itemType} pour commencer à construire votre liste de référence

# addFirstItemButton
source: Add First {itemType}
fr: Ajouter le Premier {itemType}

# yourReferenceList
source: Your {itemType} Reference List
fr: Votre Liste de Référence {itemType}

# itemsWithRatings
source: {count} items with your ratings and recommendations
fr: {count} articles avec vos évaluations et recommandations

# yourListEmpty
source: Your {itemType} List is Empty
fr: Votre Liste de {itemType}s est Vide

# rateItemsToBuild
source: Rate {itemType}s to build your reference list
fr: Évaluez des {itemType}s pour construire votre liste de référence

# exploreItems
source: Explore {itemType}s
fr: Explorer les {itemType}s

source: Item Not Found
fr: Article Non Trouvé

source: Go Back
fr: Retour

# offlineRatingData
source: Offline - Rating data may not be up to date
fr: Hors ligne - Les données d'évaluation peuvent ne pas être à jour

source: Rate {itemName}
fr: Évaluer {itemName}

# offlineLoadingMessage
source: Loading... Connection required for full functionality
fr: Chargement... Connexion requise pour toutes les fonctionnalités

# connectionError
source: Connection error - Please check your network
fr: Erreur de connexion - Veuillez vérifier votre réseau

# offlineCachedData
source: Offline mode - Showing cached data
fr: Mode hors ligne - Affichage des données en cache

source: My Notes:
fr: Mes Notes :

# haventRatedYet
source: You haven't rated {itemName} yet
fr: Vous n'avez pas encore évalué {itemName}

# addRatingToBuild
source: Add your rating to build your personal reference list
fr: Ajoutez votre évaluation pour construire votre liste de référence personnelle

source: No Ratings Yet
fr: Aucune Évaluation Encore

# beFirstToRate
source: Be the first to rate {itemName}
fr: Soyez le premier à évaluer {itemName}

source: Community Ratings
fr: Évaluations de la Communauté

# ratingsCount
source: {count} {count, plural, =1{rating} other{ratings}}
fr: {count} {count, plural, =1{évaluation} other{évaluations}}

# averageRating
source: Average: {rating} / 5.0
fr: Moyenne : {rating} / 5.0

# mostCommonRating
source: Most common: {stars} stars ({count} {count, plural, =1{rating} other{ratings}})
fr: Plus fréquent : {stars} étoiles ({count} {count, plural, =1{évaluation} other{évaluations}})

# noSharedRatings
source: No Recommendations
fr: Aucune Recommandation

# noSharedRatingsMessage
source: No one has shared their recommendations for {itemName} with you yet
fr: Personne n'a encore partagé ses recommandations pour {itemName} avec vous

# profileIdLabel
source: Profile ID: {id}
fr: ID du Profil : {id}

# editProfileTooltip
source: Edit Profile
fr: Modifier le Profil

# deleteProfileTooltip
source: Delete Profile
fr: Supprimer le Profil

# newProfile
source: New
fr: Nouveau

# originLabel
source: Origin
fr: Origine

# producerLabel
source: Producer
fr: Producteur

# initializingApp
source: Initializing A la carte...
fr: Initialisation d'A la carte...

# initializationTakingLonger
source: This is taking longer than expected...
fr: Ceci prend plus de temps que prévu...

# profileDataCorrupted
source: Profile data corrupted. Please select your profile again.
fr: Données du profil corrompues. Veuillez sélectionner votre profil à nouveau.

# profileNotFoundOnServer
source: Your profile was not found. Please select a valid profile.
fr: Votre profil n'a pas été trouvé. Veuillez sélectionner un profil valide.

source: Your Rating
fr: Votre Évaluation

# selectRating
source: Tap to select rating
fr: Touchez pour sélectionner une note

# ratingRequired
source: Please select a rating
fr: Veuillez sélectionner une note

# addNotes
source: Add your notes
fr: Ajoutez vos notes

# notesHelper
source: Add your personal notes (optional)
fr: Ajoutez vos notes personnelles (optionnel)

source: Save Rating
fr: Enregistrer l'Évaluation

# ratingCreated
source: Rating saved successfully!
fr: Évaluation enregistrée avec succès !

# couldNotSaveRating
source: Could not save rating. Please try again.
fr: Impossible d'enregistrer l'évaluation. Veuillez réessayer.

# offlineRatingCreation
source: Offline - Changes may not be saved until reconnected
fr: Hors ligne - Les modifications peuvent ne pas être sauvegardées jusqu'à la reconnexion

source: No user selected
fr: Aucun utilisateur sélectionné

source: Dismiss
fr: Ignorer

# offlineUserSwitch
source: Offline - Rating data not available for this user
fr: Hors ligne - Données d'évaluation non disponibles pour cet utilisateur

# editRatingForItem
source: Edit Rating for {itemName}
fr: Modifier l'Évaluation pour {itemName}

source: Save Changes
fr: Enregistrer les Modifications

# ratingUpdated
source: Rating updated successfully!
fr: Évaluation mise à jour avec succès !

# couldNotUpdateRating
source: Could not update rating. Please try again.
fr: Impossible de mettre à jour l'évaluation. Veuillez réessayer.

# offlineRatingEdit
source: Offline - Changes may not be saved until reconnected
fr: Hors ligne - Les modifications peuvent ne pas être sauvegardées jusqu'à la reconnexion

source: Rating not found
fr: Évaluation non trouvée

source: Editing rating for
fr: Modification de l'évaluation pour

# originalRating
source: Original rating: {rating} stars
fr: Évaluation originale : {rating} étoiles

# unsavedChanges
source: You have unsaved changes
fr: Vous avez des modifications non sauvegardées

source: Share Rating
fr: Partager l'Évaluation

source: Share with...
fr: Partager avec...

source: Share Rating With
fr: Partager l'Évaluation Avec

# selectUsersToShare
source: Select users to share this rating with
fr: Sélectionnez les utilisateurs avec qui partager cette évaluation

# shareRatingSuccess
source: Rating shared successfully!
fr: Évaluation partagée avec succès !

# shareRatingError
source: Could not share rating. Please try again.
fr: Impossible de partager l'évaluation. Veuillez réessayer.

# sharedWith
source: Shared with {count} {count, plural, =1{person} other{people}}
fr: Partagé avec {count} {count, plural, =1{personne} other{personnes}}

# shareButtonText
source: Share
fr: Partager

# noUsersAvailable
source: No users available to share with
fr: Aucun utilisateur disponible pour le partage

source: Loading users...
fr: Chargement des utilisateurs...

source: Recommendations
fr: Recommandations

# recommendationsFromFriends
source: {count} recommendations from friends
fr: {count} recommandations d'amis

# itemTypeNotSupported
source: Item type not supported yet
fr: Type d'article pas encore pris en charge

# ratingNotFoundOrNoPermission
source: Rating not found or you do not have permission to edit it
fr: Évaluation non trouvée ou vous n'avez pas la permission de la modifier

# noPermissionToEdit
source: You do not have permission to edit this rating
fr: Vous n'avez pas la permission de modifier cette évaluation

source: No notes added
fr: Aucune note ajoutée

# userFallback
source: User {userId}
fr: Utilisateur {userId}

source: Delete Rating
fr: Supprimer l'Évaluation

# deleteRatingConfirmation
source: Delete this rating?
fr: Supprimer cette évaluation ?

# deleteRatingWarning
source: This action cannot be undone.
fr: Cette action ne peut pas être annulée.

# deleteRatingWithSharing
source: This will also remove it from {count} {count, plural, =1{person} other{people}} who have access to your recommendation.
fr: Cela la supprimera également de {count} {count, plural, =1{personne} other{personnes}} qui ont accès à votre recommandation.

# deleteRatingGenericSharing
source: If this rating has been shared, it will also be removed from other users' recommendations.
fr: Si cette évaluation a été partagée, elle sera également supprimée des recommandations d'autres utilisateurs.

# ratingDeleted
source: Rating deleted successfully
fr: Évaluation supprimée avec succès

# couldNotDeleteRating
source: Could not delete rating. Please try again.
fr: Impossible de supprimer l'évaluation. Veuillez réessayer.

source: Make Private
fr: Rendre Privé

source: No Changes
fr: Aucun Changement

# addNewItem
source: Add New {itemType}
fr: Ajouter Nouveau {itemType}

# editItem
source: Edit {itemName}
fr: Modifier {itemName}

# createItem
source: Create {itemType}
fr: Créer {itemType}

# itemCreated
source: {itemType} created successfully!
fr: {itemType} créé avec succès !

# itemUpdated
source: {itemType} updated successfully!
fr: {itemType} mis à jour avec succès !

# couldNotCreateItem
source: Could not create {itemType}. Please try again.
fr: Impossible de créer le {itemType}. Veuillez réessayer.

# couldNotUpdateItem
source: Could not update {itemType}. Please try again.
fr: Impossible de mettre à jour le {itemType}. Veuillez réessayer.

# itemNameRequired
source: {itemType} name is required
fr: Le nom du {itemType} est requis

# itemNameTooShort
source: {itemType} name must be at least 2 characters
fr: Le nom du {itemType} doit contenir au moins 2 caractères

# itemNameTooLong
source: {itemType} name must be less than 100 characters
fr: Le nom du {itemType} doit contenir moins de 100 caractères

# typeRequired
source: Type is required
fr: Le type est requis

# originRequired
source: Origin is required
fr: L'origine est requise

# producerRequired
source: Producer is required
fr: Le producteur est requis

source: Select type...
fr: Sélectionner le type...

source: Enter origin
fr: Entrer l'origine

source: Enter producer
fr: Entrer le producteur

# enterDescription
source: Enter description (optional)
fr: Entrer la description (optionnel)

# descriptionTooLong
source: Description must be less than 500 characters
fr: La description doit contenir moins de 500 caractères

# offlineItemCreation
source: Offline - Item may not be saved until reconnected
fr: Hors ligne - L'article peut ne pas être sauvegardé jusqu'à la reconnexion

# offlineItemEdit
source: Offline - Changes may not be saved until reconnected
fr: Hors ligne - Les modifications peuvent ne pas être sauvegardées jusqu'à la reconnexion

# unsavedChangesMessage
source: You have unsaved changes. Are you sure you want to go back?
fr: Vous avez des modifications non sauvegardées. Êtes-vous sûr de vouloir revenir ?

source: Discard
fr: Abandonner

# updateInfoBelow
source: Update the information below
fr: Mettez à jour les informations ci-dessous

# fillDetailsToAdd
source: Fill in the details to add to your collection
fr: Remplissez les détails pour ajouter à votre collection

source: Saving...
fr: Sauvegarde...

# cheeseTypeHint
source: e.g. Soft, Hard, Semi-soft, Blue
fr: ex: Mou, Dur, Mi-dur, Bleu

# enterItemName
source: Enter {itemType} name
fr: Entrer le nom du {itemType}

# optionalFieldHelper
source: Optional - up to {maxLength} characters
fr: Optionnel - jusqu'à {maxLength} caractères

source: Edit {itemType}
fr: Modifier {itemType}

source: Add New {itemType}
fr: Ajouter Nouveau {itemType}

source: Optional
fr: Optionnel

# searchCheeseHint
source: Search cheeses by name, type, origin...
fr: Rechercher fromages par nom, type, origine...

source: No Results Found
fr: Aucun Résultat Trouvé

# adjustSearchFilters
source: Try adjusting your search or filters
fr: Essayez d'ajuster votre recherche ou vos filtres

source: Clear All Filters
fr: Effacer Tous les Filtres

# filterBy
source: Filter by {category}
fr: Filtrer par {category}

# showingResults
source: Showing {filtered} of {total} items
fr: Affichage de {filtered} sur {total} articles

# searchItemsByName
source: Search {itemType}s by name...
fr: Rechercher {itemType}s par nom...

source: Search by name...
fr: Rechercher par nom...

# searchCheeseByNameHint
source: Search cheeses by name...
fr: Rechercher fromages par nom...

# myRatingsFilter
source: My Ratings
fr: Mes Évaluations

# recommendationsFilter
source: Recommendations
fr: Recommandations

# ratedFilter
source: Rated
fr: Évalué

# unratedFilter
source: Unrated
fr: Non évalué

# allFilterOption
source: All
fr: Tous

source: Show Filters
fr: Afficher les Filtres

source: Hide Filters
fr: Masquer les Filtres

source: User Profile
fr: Profil Utilisateur

source: Sign Out
fr: Se Déconnecter

# signOutConfirmation
source: Are you sure you want to sign out? You will need to sign in again to access your ratings.
fr: Êtes-vous sûr de vouloir vous déconnecter ? Vous devrez vous reconnecter pour accéder à vos évaluations.

source: App Preferences
fr: Préférences de l'App

source: Dark Mode
fr: Mode Sombre

# darkModeDescription
source: Use dark theme throughout the app
fr: Utiliser le thème sombre dans toute l'application

source: Display Language
fr: Langue d'Affichage

# displayLanguageDescription
source: Choose your preferred language
fr: Choisissez votre langue préférée

# profileAndAccount
source: Profile & Account
fr: Profil & Compte

source: Display Name
fr: Nom d'Affichage

source: Tap to set display name
fr: Touchez pour définir le nom d'affichage

source: Edit Display Name
fr: Modifier le Nom d'Affichage

# displayNameHelper
source: This is how other users will see you
fr: C'est ainsi que les autres utilisateurs vous verront

# displayNameUpdated
source: Display name updated successfully
fr: Nom d'affichage mis à jour avec succès

source: Error updating display name
fr: Erreur lors de la mise à jour du nom d'affichage

source: Discoverable for Sharing
fr: Découvrable pour le Partage

# discoverableDescription
source: Allow other users to find you when sharing ratings
fr: Permettre aux autres utilisateurs de vous trouver lors du partage d'évaluations

# discoverabilityEnabled
source: You are now discoverable for sharing
fr: Vous êtes maintenant découvrable pour le partage

# discoverabilityDisabled
source: You are no longer discoverable for sharing
fr: Vous n'êtes plus découvrable pour le partage

source: Error updating settings
fr: Erreur lors de la mise à jour des paramètres

source: About
fr: À Propos

source: App Version
fr: Version de l'App

source: Privacy Policy
fr: Politique de Confidentialité

# learnAboutPrivacy
source: Learn about your data and privacy
fr: En savoir plus sur vos données et votre confidentialité

# privacyPolicyContent
source: A la carte is designed with privacy first. All your ratings are private by default. You choose exactly which ratings to share and with whom. Your email and full name are never shown to other users.
fr: A la carte est conçu avec la confidentialité en priorité. Toutes vos évaluations sont privées par défaut. Vous choisissez exactement quelles évaluations partager et avec qui. Votre email et nom complet ne sont jamais montrés aux autres utilisateurs.

source: Close
fr: Fermer

source: Danger Zone
fr: Zone Dangereuse

source: Delete Account
fr: Supprimer le Compte

# deleteAccountDescription
source: Permanently delete your account and all data
fr: Supprimer définitivement votre compte et toutes les données

# deleteAccountWarning
source: This will permanently delete your account and all your data. This action cannot be undone.
fr: Cela supprimera définitivement votre compte et toutes vos données. Cette action ne peut pas être annulée.

# deleteAccountConsequences
source: All your ratings, shared content, and profile information will be permanently removed from A la carte.
fr: Toutes vos évaluations, contenu partagé et informations de profil seront définitivement supprimés d'A la carte.

# accountDeleted
source: Account deleted successfully
fr: Compte supprimé avec succès

source: Error deleting account
fr: Erreur lors de la suppression du compte

source: Anonymous User
fr: Utilisateur Anonyme

source: Privacy Settings
fr: Paramètres de Confidentialité

source: User not authenticated
fr: Utilisateur non authentifié

source: Privacy Overview
fr: Aperçu de la Confidentialité

source: Your Sharing Activity
fr: Votre Activité de Partage

# sharedRatingsCount
source: {count} shared {count, plural, =1{rating} other{ratings}}
fr: {count} {count, plural, =1{évaluation partagée} other{évaluations partagées}}

# recipientsCount
source: {count} {count, plural, =1{recipient} other{recipients}}
fr: {count} {count, plural, =1{destinataire} other{destinataires}}

source: Discovery Settings
fr: Paramètres de Découverte

# discoverabilityExplanation
source: Controls who can find you when sharing new ratings
fr: Contrôle qui peut vous trouver lors du partage de nouvelles évaluations

# discoverabilityDisabledWithExplanation
source: You are no longer discoverable. Existing shared ratings remain accessible.
fr: Vous n'êtes plus découvrable. Les évaluations partagées existantes restent accessibles.

source: Bulk Privacy Actions
fr: Actions de Confidentialité en Lot

source: Make All Ratings Private
fr: Rendre Toutes les Évaluations Privées

# makeAllRatingsPrivateDescription
source: Remove sharing from all your ratings at once
fr: Supprimer le partage de toutes vos évaluations en une fois

source: Remove Person from All Shares
fr: Retirer une Personne de Tous les Partages

# removePersonFromAllSharesDescription
source: Remove a specific person from all your shared ratings
fr: Retirer une personne spécifique de toutes vos évaluations partagées

# comingSoonLabel
source: (Coming Soon)
fr: (Bientôt Disponible)

source: Manage Individual Shares
fr: Gérer les Partages Individuels

source: No Shared Ratings Yet
fr: Aucune Évaluation Partagée

# noSharedRatingsExplanation
source: All your ratings are currently private. Share ratings to help others discover great items!
fr: Toutes vos évaluations sont actuellement privées. Partagez des évaluations pour aider les autres à découvrir de bons articles !

# sharedWithCount
source: Shared with {count} {count, plural, =1{person} other{people}}
fr: Partagé avec {count} {count, plural, =1{personne} other{personnes}}
