Repository: davidcharbonnier/alacarte-client
Catalog: lib/l10n/app_*.arb
Languages: fr

# manageSharingForRating
source: Manage sharing for this rating
fr: Gérer le partage pour cette évaluation

# viewAllSharedRatings
source: View All {count} Shared Ratings
fr: Voir Toutes les {count} Évaluations Partagées

# makeAllPrivateWarning
source: This will remove sharing from all {count} of your shared ratings. Recipients will no longer see your recommendations.
fr: Cela supprimera le partage de toutes vos {count} évaluations partagées. Les destinataires ne verront plus vos recommandations.

# makeAllPrivateConsequences
source: This action cannot be undone. You will need to re-share each rating individually if you change your mind.
fr: Cette action ne peut pas être annulée. Vous devrez re-partager chaque évaluation individuellement si vous changez d'avis.

source: Making ratings private...
fr: Privatisation des évaluations...

# allRatingsMadePrivate
source: All ratings are now private
fr: Toutes les évaluations sont maintenant privées

source: Error making ratings private
fr: Erreur lors de la privatisation des évaluations

source: Feature coming soon
fr: Fonctionnalité bientôt disponible

# useExistingShareDialog
source: Use the share button on the rating to manage sharing
fr: Utilisez le bouton de partage sur l'évaluation pour gérer le partage

# manageDataSharing
source: Manage your data sharing and privacy controls
fr: Gérer vos contrôles de partage de données et de confidentialité

source: No recipients to remove
fr: Aucun destinataire à supprimer

# selectPersonToRemove
source: Select a person to remove from all your shared ratings:
fr: Sélectionnez une personne à retirer de toutes vos évaluations partagées :

# sharedRatingsWithUser
source: {count} shared {count, plural, =1{rating} other{ratings}}
fr: {count} {count, plural, =1{évaluation partagée} other{évaluations partagées}}

source: Remove User from Shares
fr: Retirer l'Utilisateur des Partages

# removeUserWarning
source: This will remove {userName} from all your shared ratings. They will no longer see your recommendations.
fr: Cela retirera {userName} de toutes vos évaluations partagées. Cette personne ne verra plus vos recommandations.

source: Remove User
fr: Retirer l'Utilisateur

# removingUserFromShares
source: Removing {userName} from shares...
fr: Suppression de {userName} des partages...

# userRemovedFromShares
source: {userName} removed from {count} {count, plural, =1{rating} other{ratings}}
fr: {userName} retiré de {count} {count, plural, =1{évaluation} other{évaluations}}

source: Error removing user from shares
fr: Erreur lors de la suppression de l'utilisateur des partages

# sharingPreferencesUpdated
source: Sharing preferences updated successfully
fr: Préférences de partage mises à jour avec succès

# ratingUnsharedFromUsers
source: Rating unshared from {count} {count, plural, =1{user} other{users}}
fr: Évaluation non partagée avec {count} {count, plural, =1{personne} other{personnes}}

# managePrivacyAndDiscovery
source: Manage your privacy and discovery controls
fr: Gérer vos contrôles de confidentialité et de découverte

source: Loading item details...
fr: Chargement des détails des articles...

source: Bulk privacy actions coming soon
fr: Actions de confidentialité en lot bientôt disponibles

source: Remove person feature coming soon
fr: Fonction de suppression de personne bientôt disponible

# cannotManageSharing
source: Cannot manage sharing for this rating
fr: Impossible de gérer le partage pour cette évaluation

source: Error updating sharing
fr: Erreur lors de la mise à jour du partage

# featureNotImplementedOnServer
source: Feature not yet implemented on server
fr: Fonctionnalité pas encore implémentée sur le serveur

source: Invalid display name
fr: Nom d'affichage invalide

# typeDisplayNameToConfirm
source: To confirm deletion, type your display name "{displayName}" below:
fr: Pour confirmer la suppression, tapez votre nom d'affichage "{displayName}" ci-dessous :

source: Deleting account...
fr: Suppression du compte...

# deletionMayTakeTime
source: This may take a moment
fr: Cela peut prendre un moment

source: This action cannot be undone.
fr: Cette action ne peut pas être annulée.

source: Retry
fr: Réessayer

source: Connection Required
fr: Connexion Requise

# offlineOperationBlocked
source: This operation requires an internet connection
fr: Cette opération nécessite une connexion internet

# connectAndRetry
source: Please connect to the internet and try again
fr: Veuillez vous connecter à internet et réessayer

# noInternetConnectionTitle
source: No Internet Connection
fr: Pas de Connexion Internet

# serverUnavailableTitle
source: Server Unavailable
fr: Serveur Indisponible

# connectedTitle
source: Connected
fr: Connecté

# noInternetConnectionDescription
source: A la carte needs an internet connection to sync your ratings and preferences. Please check your network settings and try again.
fr: A la carte a besoin d'une connexion internet pour synchroniser vos évaluations et préférences. Veuillez vérifier vos paramètres réseau et réessayer.

# serverUnavailableDescription
source: A la carte server is temporarily unavailable. This might be due to maintenance or a temporary issue. We'll keep trying to reconnect.
fr: Le serveur d'A la carte est temporairement indisponible. Cela pourrait être dû à une maintenance ou un problème temporaire. Nous continuons d'essayer de nous reconnecter.

# connectionRestoredDescription
source: Connection restored! You can now use all features of A la carte.
fr: Connexion rétablie ! Vous pouvez maintenant utiliser toutes les fonctionnalités d'A la carte.

# signInRequiresConnection
source: Sign in requires an internet connection
fr: Se connecter nécessite une connexion internet

# serverTemporarilyUnavailable
source: Server temporarily unavailable. Please try again.
fr: Serveur temporairement indisponible. Veuillez réessayer.

# connectionFailedCheckNetwork
source: Connection failed. Please check your network and try again.
fr: Échec de connexion. Veuillez vérifier votre réseau et réessayer.

# settingUpPreferenceHub
source: Setting up your preference hub...
fr: Configuration de votre centre de préférences...

source: Verifying account...
fr: Vérification du compte...

source: Working offline...
fr: Mode hors ligne...

source: Profile setup required...
fr: Configuration du profil requise...

source: Ready! Welcome back.
fr: Prêt ! Bon retour.

source: Sign in required...
fr: Connexion requise...

# preparingPreferences
source: Preparing your preferences...
fr: Préparation de vos préférences...

source: Complete Your Profile
fr: Complétez Votre Profil

source: Welcome to A la carte!
fr: Bienvenue sur A la carte !

# hiUserSetupProfile
source: Hi {firstName}! Let's set up your profile.
fr: Salut {firstName} ! Configurons votre profil.

# displayNameFieldHelper
source: This is how other users will see you when you share ratings
fr: C'est ainsi que les autres utilisateurs vous verront lorsque vous partagez des évaluations

# displayNameRequired
source: Display name is required
fr: Le nom d'affichage est requis

# displayNameTooShort
source: Display name must be at least 2 characters
fr: Le nom d'affichage doit contenir au moins 2 caractères

# displayNameTooLong
source: Display name must be less than 50 characters
fr: Le nom d'affichage doit contenir moins de 50 caractères

# displayNameAvailable
source: ✓ Display name is available
fr: ✓ Nom d'affichage disponible

# displayNameTaken
source: ✗ Display name is already taken
fr: ✗ Nom d'affichage déjà pris

source: ⚠ Could not check availability
fr: ⚠ Impossible de vérifier la disponibilité

# privacySettingsTitle
source: Privacy Settings
fr: Paramètres de Confidentialité

source: Discoverable by Others
fr: Découvrable par les Autres

# discoverabilityHelper
source: Allow other users to find you when sharing ratings. You can change this later in settings.
fr: Permettre aux autres utilisateurs de vous trouver lors du partage d'évaluations. Vous pouvez changer cela plus tard dans les paramètres.

source: Setting up profile...
fr: Configuration du profil...

source: Complete Profile
fr: Compléter le Profil

source: Your Privacy Matters
fr: Votre Confidentialité Compte

# privacyExplanation
source: All your ratings are private by default. You choose exactly which ratings to share and with whom. Your email and full name are never shown to other users - only your display name.
fr: Toutes vos évaluations sont privées par défaut. Vous choisissez exactement quelles évaluations partager et avec qui. Votre email et nom complet ne sont jamais montrés aux autres utilisateurs - seulement votre nom d'affichage.

source: French
fr: Français

source: English
fr: Anglais

source: Follows device language
fr: Suit la langue de l'appareil

# profileLabel
source: Profile
fr: Profil

source: Enter gin name
fr: Entrer le nom du gin

# enterProfile
source: Enter flavor profile
fr: Entrer le profil aromatique

# profileHint
source: e.g., Forestier / boréal, Floral, Épicé
fr: ex: Forestier / boréal, Floral, Épicé

# profileHelperText
source: Optional - flavor category
fr: Optionnel - catégorie de saveur

# ginCreated
source: Gin created successfully!
fr: Gin créé avec succès !

# ginUpdated
source: Gin updated successfully!
fr: Gin mis à jour avec succès !

# ginDeleted
source: Gin deleted successfully!
fr: Gin supprimé avec succès !

source: Create Gin
fr: Créer un Gin

source: Edit Gin
fr: Modifier le Gin

source: Add Gin
fr: Ajouter un Gin

source: All Gins
fr: Tous les Gins

source: My Gin List
fr: Ma Liste de Gins

source: Filter by producer
fr: Filtrer par producteur

source: Filter by origin
fr: Filtrer par origine

# filterByProfile
source: Filter by flavor profile
fr: Filtrer par profil

source: No gins found
fr: Aucun gin trouvé

source: Loading gins...
fr: Chargement des gins...

# profileRequired
source: Profile is required
fr: Le profil est requis

# editItemTooltip
source: Edit item
fr: Modifier l'article
